# LegendShowDescription Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialFieldManager..::..LegendShowDescription Property
SpatialFieldManager Class See Also
---
If true legend contains analysis description.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool LegendShowDescription { get; set; }
```

Visual Basic
---
```text
Public Property LegendShowDescription As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool LegendShowDescription {
	bool get ();
	void set (bool value);
}
```

# See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace